tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "teamookla/speedtest"
brew "ack"
brew "zstd"
brew "libtiff"
brew "gdk-pixbuf"
brew "pango"
brew "aha"
brew "ansible"
brew "jpeg-xl"
brew "aom"
brew "awk"
brew "bat"
brew "openjdk"
brew "bfg"
brew "boost"
brew "cheat"
brew "cmake"
brew "cmatrix"
brew "gmp"
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "curl"
brew "dfu-util"
brew "docker", link: false
brew "docker-compose", link: false
brew "dust"
brew "enscript"
brew "entr"
brew "fd"
brew "gcc"
brew "libevent"
brew "unbound"
brew "libarchive"
brew "libass"
brew "openblas"
brew "numpy", link: false
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "ffmpegthumbnailer"
brew "open-mpi"
brew "figlet"
brew "fping"
brew "libtool"
brew "fzf"
brew "git"
brew "glances"
brew "gnu-sed"
brew "gnupg"
brew "gobject-introspection"
brew "gtk+3"
brew "jack"
brew "pygobject3"
brew "qt@5"
brew "uhd"
brew "volk"
brew "gnuradio"
brew "go"
brew "gping"
brew "netpbm"
brew "graphviz"
brew "guile"
brew "hackrf"
brew "highlight"
brew "hopenpgp-tools"
brew "htop"
brew "httpie"
brew "iftop"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "jpeg"
brew "jq"
brew "json-c"
brew "libcaca"
brew "llvm"
brew "lolcat"
brew "lsd"
brew "luarocks"
brew "lynx"
brew "massren"
brew "minikube"
brew "mtr"
brew "multitail"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nload"
brew "nmap"
brew "node"
brew "nuttcp"
brew "tree"
brew "pass"
brew "php"
brew "pinentry-mac"
brew "prettier"
brew "procs"
brew "qt"
brew "pyqt"
brew "python@3.10"
brew "python@3.11"
brew "tcl-tk", link: false
brew "python@3.8"
brew "python@3.9"
brew "qemu"
brew "qpdf"
brew "re2"
brew "ripgrep"
brew "rlwrap"
brew "rust"
brew "sd"
brew "sip"
brew "sl"
brew "sphinx-doc"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "stylua"
brew "swaks"
brew "switchaudio-osx"
brew "telnet"
brew "the_silver_searcher"
brew "tldr", link: false
brew "utf8proc"
brew "tmux"
brew "toilet"
brew "tokei"
brew "trash"
brew "tre-command"
brew "w3m"
brew "watch"
brew "wget"
brew "xmlstarlet"
brew "xq"
brew "yarn"
brew "ykman"
brew "ykpers"
brew "youtube-dl"
brew "yq"
brew "z"
brew "zoxide"
brew "zsh"
brew "zsh-vi-mode"
brew "teamookla/speedtest/speedtest"
cask "amethyst"
cask "chromedriver"
cask "intel-haxm"
cask "karabiner-elements"
cask "keepassxc"
cask "keycastr"
cask "kitty"
cask "maccy"
cask "neovide"
cask "powershell"
cask "rar"
cask "raycast"
cask "spacelauncher"
cask "vagrant"
cask "vagrant-manager"
cask "xquartz"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "asuka.insertnumbers"
vscode "asvetliakov.vscode-neovim"
vscode "azemoh.theme-onedark"
vscode "be5invis.toml"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "chakrounanas.turbo-console-log"
vscode "codeout.vscode-junos"
vscode "cweijan.vscode-autohotkey-plus"
vscode "dakara.transformer"
vscode "daylerees.rainglow"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "drywolf.dark-plus-plus-theme"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "everettjf.filter-line"
vscode "felipe-mendes.slack-theme"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "florianduros.theme-dracula-italics-turbo"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "geeksharp.openssl-configuration-file"
vscode "gerane.theme-flatgrammer"
vscode "gerane.theme-flatlandmonokai"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "heron.firefox-devtools-theme"
vscode "humao.rest-client"
vscode "idbartosz.darkpp-italic"
vscode "idleberg.hopscotch"
vscode "ionutvmi.reg"
vscode "jamiewoodio.cisco"
vscode "jdinhlife.gruvbox"
vscode "jianbingfang.dupchecker"
vscode "johnpapa.vscode-peacock"
vscode "jprestidge.theme-material-theme"
vscode "karigari.chat"
vscode "kenhowardpdx.vscode-gist"
vscode "letrieu.expand-region"
vscode "lextudio.restructuredtext"
vscode "lkytal.flatui"
vscode "max-ss.cyberpunk"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-materialkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mskelton.one-dark-theme"
vscode "naumovs.color-highlight"
vscode "nuuf.theme-hackershaze"
vscode "oderwat.indent-rainbow"
vscode "pawelgrzybek.gatito-theme"
vscode "pkief.material-icon-theme"
vscode "pustelto.bracketeer"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reloadedextensions.reloaded-themes"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rokoroku.vscode-theme-darcula"
vscode "ryu1kn.edit-with-shell"
vscode "ryu1kn.partial-diff"
vscode "sallar.vscode-duotone-dark"
vscode "samuelcolvin.jinjahtml"
vscode "sdras.night-owl"
vscode "serge.vsc-material-theme-italicize"
vscode "sheafitzek.fitz-dark-italic-vscode-theme"
vscode "shidhincr.theme-dracula-italics"
vscode "sumneko.lua"
vscode "taniarascia.new-moon-vscode"
vscode "thenikso.github-plus-theme"
vscode "trond-snekvik.simple-rst"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscode-snippet.snippet"
vscode "vscodevim.vim"
vscode "vscoss.vscode-ansible"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "whtsky.agila-theme"
vscode "wingrunr21.vscode-ruby"
vscode "xabikos.javascriptsnippets"
vscode "youssef.viow"
vscode "yummygum.city-lights-theme"
