tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Software library to render fonts
brew "freetype"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-line option parsing utility
brew "gnu-getopt", link: true
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Kubernetes package manager
brew "helm"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# Colorize your kubectl output
brew "kubecolor"
# Terminal file manager
brew "lf"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Run a Kubernetes cluster locally
brew "minikube"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Shell command parallelization utility
brew "parallel"
# Password manager
brew "pass"
# General-purpose scripting language
brew "php"
# Display the PID number for a given process name
brew "pidof"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Modern replacement for ps written in Rust
brew "procs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Intuitive find & replace CLI
brew "sd"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Tree command, improved
brew "tre-command"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# XML command-line utilities
brew "xmlstarlet"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Vault
brew "hashicorp/tap/vault"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
cask "font-victor-mono-nerd-font"
# Free and open-source image editor
cask "gimp"
# Password manager app
cask "keepassxc"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Clipboard manager
cask "maccy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Command-line shell and scripting language
cask "powershell"
# Control your tools with a few keystrokes
cask "raycast"
# App launcher/switcher
cask "spacelauncher"
# System monitor for the menu bar
cask "stats"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "asuka.insertnumbers"
vscode "asvetliakov.vscode-neovim"
vscode "azemoh.theme-onedark"
vscode "be5invis.toml"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "chakrounanas.turbo-console-log"
vscode "codeout.vscode-junos"
vscode "cweijan.vscode-autohotkey-plus"
vscode "dakara.transformer"
vscode "daylerees.rainglow"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "drywolf.dark-plus-plus-theme"
vscode "ecmel.vscode-html-css"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "everettjf.filter-line"
vscode "felipe-mendes.slack-theme"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "florianduros.theme-dracula-italics-turbo"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxnne.feppz--theme"
vscode "geeksharp.openssl-configuration-file"
vscode "gerane.theme-flatgrammer"
vscode "gerane.theme-flatlandmonokai"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "heron.firefox-devtools-theme"
vscode "humao.rest-client"
vscode "idbartosz.darkpp-italic"
vscode "idleberg.hopscotch"
vscode "ionutvmi.reg"
vscode "jamiewoodio.cisco"
vscode "jdinhlife.gruvbox"
vscode "jianbingfang.dupchecker"
vscode "johnpapa.vscode-peacock"
vscode "jprestidge.theme-material-theme"
vscode "kenhowardpdx.vscode-gist"
vscode "letrieu.expand-region"
vscode "lkytal.flatui"
vscode "max-ss.cyberpunk"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-materialkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mskelton.one-dark-theme"
vscode "naumovs.color-highlight"
vscode "nickdemayo.vscode-json-editor"
vscode "nuuf.theme-hackershaze"
vscode "oderwat.indent-rainbow"
vscode "pawelgrzybek.gatito-theme"
vscode "pkief.material-icon-theme"
vscode "pustelto.bracketeer"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reloadedextensions.reloaded-themes"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rokoroku.vscode-theme-darcula"
vscode "ryu1kn.edit-with-shell"
vscode "ryu1kn.partial-diff"
vscode "sallar.vscode-duotone-dark"
vscode "samuelcolvin.jinjahtml"
vscode "sdras.night-owl"
vscode "serge.vsc-material-theme-italicize"
vscode "sheafitzek.fitz-dark-italic-vscode-theme"
vscode "shidhincr.theme-dracula-italics"
vscode "taniarascia.new-moon-vscode"
vscode "thenikso.github-plus-theme"
vscode "trond-snekvik.simple-rst"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "whtsky.agila-theme"
vscode "xabikos.javascriptsnippets"
vscode "yatki.vscode-surround"
vscode "youssef.viow"
vscode "yummygum.city-lights-theme"
vscode "zhuangtongfa.material-theme"
