tap "felixkratz/formulae"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "teamookla/speedtest"
# Search tool like grep, but optimized for programmers
brew "ack"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Simple, modern, secure file encryption
brew "age"
# ANSI HTML adapter
brew "aha"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Text processing scripting language
brew "awk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Tool for browsing source code
brew "cscope"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# USB programmer
brew "dfu-util"
# More intuitive version of du in rust
brew "dust"
# Convert text to Postscript, HTML, or RTF, with syntax highlighting
brew "enscript"
# Run arbitrary commands when files change
brew "entr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# SDK for signal processing blocks to implement software radios
brew "gnuradio"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Low cost software radio platform
brew "hackrf"
# Kubernetes package manager
brew "helm"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Colorize your kubectl output
brew "kubecolor"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Convert pixel information into colored ASCII art
brew "libcaca"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Easily rename multiple files using your text editor
brew "massren"
# Run a Kubernetes cluster locally
brew "minikube"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Realtime console network usage monitor
brew "nload"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Network performance measurement tool
brew "nuttcp"
# Password manager
brew "pass"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Python bindings for v6 of Qt
brew "pyqt"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Safe, concurrent, practical language
brew "rust"
# Intuitive find & replace CLI
brew "sd"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Editor of encrypted files
brew "sops"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# SMTP command-line test tool
brew "swaks"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "talosctl"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Tree command, improved
brew "tre-command"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# XML command-line utilities
brew "xmlstarlet"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Tracks most-used directories to make cd smarter
brew "z"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Flux CLI
brew "fluxcd/tap/flux"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Private desktop AI chat application
cask "anythingllm"
# Menu bar icon organiser
cask "bartender"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# E-books management software
cask "calibre"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Screen capturing tool
cask "cleanshot"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Voice and text chat software
cask "discord"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Download manager with a torrent client
cask "folx"
cask "font-victor-mono-nerd-font"
# Web browser
cask "google-chrome"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Discover, download, and run local LLMs
cask "lm-studio"
# Clipboard manager
cask "maccy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Desktop virtualization software
cask "parallels"
# Screen measuring tool
cask "pixelsnap"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Kubernetes and container management on the desktop
cask "rancher"
# Archive manager for data compression and backups
cask "rar"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# App launcher/switcher
cask "spacelauncher"
# System monitor for the menu bar
cask "stats"
# Control windows and applications right from your trackpad
cask "swish"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "anysphere.cursorpyright"
vscode "asuka.insertnumbers"
vscode "asvetliakov.vscode-neovim"
vscode "azemoh.theme-onedark"
vscode "be5invis.toml"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "chakrounanas.turbo-console-log"
vscode "codeout.vscode-junos"
vscode "dakara.transformer"
vscode "daylerees.rainglow"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "drywolf.dark-plus-plus-theme"
vscode "ecmel.vscode-html-css"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "everettjf.filter-line"
vscode "felipe-mendes.slack-theme"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "florianduros.theme-dracula-italics-turbo"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxnne.feppz--theme"
vscode "geeksharp.openssl-configuration-file"
vscode "gerane.theme-flatgrammer"
vscode "gerane.theme-flatlandmonokai"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "heron.firefox-devtools-theme"
vscode "humao.rest-client"
vscode "idbartosz.darkpp-italic"
vscode "idleberg.hopscotch"
vscode "ionutvmi.reg"
vscode "jamiewoodio.cisco"
vscode "jdinhlife.gruvbox"
vscode "jianbingfang.dupchecker"
vscode "johnpapa.vscode-peacock"
vscode "jprestidge.theme-material-theme"
vscode "kenhowardpdx.vscode-gist"
vscode "letrieu.expand-region"
vscode "lkytal.flatui"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "max-ss.cyberpunk"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-materialkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "mskelton.one-dark-theme"
vscode "naumovs.color-highlight"
vscode "nickdemayo.vscode-json-editor"
vscode "nuuf.theme-hackershaze"
vscode "oderwat.indent-rainbow"
vscode "pawelgrzybek.gatito-theme"
vscode "pkief.material-icon-theme"
vscode "pustelto.bracketeer"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reloadedextensions.reloaded-themes"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rokoroku.vscode-theme-darcula"
vscode "ryu1kn.edit-with-shell"
vscode "ryu1kn.partial-diff"
vscode "sallar.vscode-duotone-dark"
vscode "samuelcolvin.jinjahtml"
vscode "sdras.night-owl"
vscode "serge.vsc-material-theme-italicize"
vscode "sheafitzek.fitz-dark-italic-vscode-theme"
vscode "shidhincr.theme-dracula-italics"
vscode "shopify.ruby-lsp"
vscode "sourcegraph.cody-ai"
vscode "supermaven.supermaven"
vscode "taniarascia.new-moon-vscode"
vscode "thenikso.github-plus-theme"
vscode "trond-snekvik.simple-rst"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "whtsky.agila-theme"
vscode "xabikos.javascriptsnippets"
vscode "yatki.vscode-surround"
vscode "youssef.viow"
vscode "yummygum.city-lights-theme"
vscode "yy0931.vscode-sqlite3-editor"
vscode "zhuangtongfa.material-theme"
go "github.com/mdempsky/gocode"
go "golang.org/x/tools/gopls"
go "github.com/x-motemen/gore/cmd/gore"
go "github.com/jonasvinther/medusa"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/traefik/yaegi/cmd/yaegi"
